
"""
Приложение имеет REST-метод, который сохраняет данные по фильму.
Клиент отправляет в теле запроса json.

Сделать так, чтобы функция unique_tags возвращала уникальные теги.
"""


def unique_tags(payload: dict) -> list:
    tags = payload.get('tags', [])
    return [tag for tag, _ in set((tag, type(tag)) for tag in tags)]


PAYLOAD = {
    "title": "Звездные войны 1: Империя приносит баги",
    "description": "Эпичная сага по поиску багов в старом легаси проекте Империи",
    "tags": [2, "семейное кино", "космос", 1.0, "сага", "эпик", "добро против зла", True, "челмедведосвин", "debug", "ipdb", "PyCharm", "боевик", "боевик", "эникей", "дарт багус", 5, 6, 4, "блокбастер", "кино 2020", 7, 3, 9, 12, "каникулы в космосе", "коварство"],
    "version": 17
}

result = unique_tags(PAYLOAD)
print('Результат', result)
